app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "parent_comment_id", "post_id", "author_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "so crazyyyy"], ["parent_comment_id", 1], ["post_id", 3], ["author_id", 2]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.author_id = current_user.id
    if @comment.save