app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["username", "hello"], ["password_digest", "$2a$10$AbY2Z1RcZ5zwdY6XoJgoJu09cuDmRgXVFYPgO7snfsKuNx7p1kkca"], ["session_token", "iExXfEgZNESRIVKI-WfWeg"]]
---
  def create
    @user = User.new(user_params)
    if @user.save